#+TITLE: Workshop 01 - Guile ChangeFlow Basics
#+AUTHOR: dsp-dr
#+DATE: 2025-09-13
#+STARTUP: overview
#+PROPERTY: header-args:scheme :session *guile*

** Exercise 1.1: Understanding Change Types

#+begin_src scheme
;; Define the three change types in ITIL 4
(define-record-type <change-type>
  (make-change-type name description risk-threshold auto-approval)
  change-type?
  (name change-type-name)
  (description change-type-description)
  (risk-threshold change-type-risk-threshold)
  (auto-approval change-type-auto-approval))

;; Standard changes - low risk, pre-approved
(define standard-change
  (make-change-type "Standard"
                   "Pre-approved, low-risk changes"
                   30
                   #t))

;; Normal changes - require assessment
(define normal-change
  (make-change-type "Normal"
                   "Changes requiring assessment and approval"
                   70
                   #f))

;; Emergency changes - high risk, expedited
(define emergency-change
  (make-change-type "Emergency"
                   "Urgent changes to restore service"
                   100
                   #f))

;; Test your understanding
(display "Standard change threshold: ")
(display (change-type-risk-threshold standard-change))
(newline)
#+end_src

#+RESULTS:
: Standard change threshold: 30

** Exercise 2.1: Create Your First Change

#+begin_src scheme
;; Create a sample change request
(define my-change
  (create-change "Update API documentation"
                 "Add new endpoints to OpenAPI spec"
                 '("api-gateway" "documentation")))

;; Inspect the change
(display "Change ID: ") (display (change-request-id my-change)) (newline)
(display "Title: ") (display (change-request-title my-change)) (newline)
(display "Status: ") (display (change-request-status my-change)) (newline)
#+end_src

#+RESULTS:
: Change ID: CHG-1
: Title: Update API documentation
: Status: submitted

** Exercise 2.2: State Transitions

#+begin_src scheme
;; Try valid transition
(transition-change! my-change 'assessing)

;; Try invalid transition (should error)
;; (transition-change! my-change 'completed)  ; Uncomment to see error
#+end_src

#+RESULTS:
: Changed CHG-1 from submitted to assessing

** Exercise 3.1: Risk Scenarios

#+begin_src scheme
;; Low risk scenario
(define low-risk
  (calculate-risk "Update documentation"
                  "Fix typos in user guide"
                  '("docs")
                  'normal))

;; High risk scenario
(define high-risk
  (calculate-risk "Production payment gateway update"
                  "Security patch for authentication system"
                  '("payment" "auth" "gateway" "database")
                  'emergency))

(format #t "Low risk score: ~a (~a)~%"
        low-risk (risk-category low-risk))
(format #t "High risk score: ~a (~a)~%"
        high-risk (risk-category high-risk))
#+end_src

#+RESULTS:
: Low risk score: 15 (low)
: High risk score: 100 (high)

** Exercise 3.2: Apply Risk to Changes

#+begin_src scheme
;; Calculate and set risk for our change
(define risk-score
  (calculate-risk (change-request-title my-change)
                  (change-request-description my-change)
                  (change-request-systems my-change)
                  'normal))

(set-change-request-risk-score! my-change risk-score)

(format #t "Change ~a risk: ~a (~a)~%"
        (change-request-id my-change)
        (change-request-risk-score my-change)
        (risk-category (change-request-risk-score my-change)))
#+end_src

#+RESULTS:
: Change CHG-1 risk: 20 (low)

** Exercise 4.1: Simulate MCP Call

#+begin_src scheme
;; Simulate what Claude would send
(define mcp-request
  '((title . "Deploy hotfix to production")
    (description . "Critical security patch for authentication bypass")
    (systems . ("auth" "api" "database"))
    (urgency . "emergency")))

;; Process the request
(define mcp-response (handle-create-change mcp-request))

;; Display response
(display "MCP Response:")
(newline)
(for-each (lambda (pair)
            (format #t "  ~a: ~a~%" (car pair) (cdr pair)))
          mcp-response)
#+end_src

#+RESULTS:
: MCP Response:
:   id: CHG-2
:   title: Deploy hotfix to production
:   risk_score: 100
:   risk_category: high
:   status: submitted
:   message: Change request created successfully

** Exercise 5.1: Approval Workflow

#+begin_src scheme
(define (auto-approve-if-eligible change)
  "Auto-approve low risk standard changes"
  (let ((risk (change-request-risk-score change)))
    (if (< risk 30)
        (begin
          (transition-change! change 'approved)
          (format #t "Auto-approved low risk change: ~a~%"
                  (change-request-id change)))
        (format #t "Change ~a requires manual approval (risk: ~a)~%"
                (change-request-id change) risk))))

;; Process our changes
(auto-approve-if-eligible my-change)
(auto-approve-if-eligible emergency-change-obj)
#+end_src

#+RESULTS:
: Changed CHG-1 from assessing to approved
: Auto-approved low risk change: CHG-1
: Change CHG-2 requires manual approval (risk: 100)

** Exercise 5.2: Dashboard View

#+begin_src scheme
(define (display-dashboard)
  "Show all changes in a dashboard format"
  (let ((changes (list-changes)))
    (display "=== CHANGEFLOW DASHBOARD ===")
    (newline)
    (for-each (lambda (change)
                (let* ((id (change-request-id change))
                       (title (change-request-title change))
                       (risk (change-request-risk-score change))
                       (status (change-request-status change))
                       (category (risk-category risk)))
                  (format #t "[~a] ~a~%" id title)
                  (format #t "  Risk: ~a (~a) | Status: ~a~%"
                          risk category status)
                  (newline)))
              changes)))

(display-dashboard)
#+end_src

#+RESULTS:
: === CHANGEFLOW DASHBOARD ===
: [CHG-2] Deploy hotfix to production
:   Risk: 100 (high) | Status: submitted
:
: [CHG-1] Update API documentation
:   Risk: 20 (low) | Status: approved
:

